name: "timesformer_dynamic_128_fp16_tensorrt"
platform: "tensorrt_plan"
max_batch_size: 0
input [
    {
        name: "pixel_values"
        data_type: TYPE_FP32
        dims: [-1, 8, 3, 224, 224]
    }
]
output [
    {
        name: "last_hidden_state"
        data_type: TYPE_FP32
        dims: [-1, 1569, 768]
    }
]
instance_group [
    {
      count: 1
      kind: KIND_GPU
      gpus: [0]
    }
]
dynamic_batching {}